src/DataProcessors/амбОбработкаЗагрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>амбОбработкаЗагрузкиДанных</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя12</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НайденнаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСЗагруженная</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСТекущая</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзмеренияЗагруженная</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзмеренияТекущая</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТДЗагруженный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТДНайденный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздатьНоменклатуру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздатьГТД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеЗагружать</Name>
							<Comment>Не загружать данную строку в исходный документ</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл) Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЗаказаПоставщиком</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКОПФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаККонтрагенту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбАфиллирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбКоммерческий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбЛаборатория</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбДилер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбДистрибютер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбКонечник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбСрокЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбСуммаЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбОтгрузкаЗапрещена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерыПокупателя</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МенеджерПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/амбОбработкаЗагрузкиДанных/Ext/ObjectModule.bsl
Процедура ВыгрузитьДанныеПоДокументу(Ссылка)  Экспорт
		
		Если ТипЗнч(Ссылка) =  Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Режим = РежимДиалогаВыбораФайла.Сохранение;
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогОткрытияФайла.ПолноеИмяФайла = "";
			Фильтр = "Текст(*.txt)|*.txt";
			ДиалогОткрытияФайла.Фильтр = Фильтр;
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = "Выберите имя файла";
			Если ДиалогОткрытияФайла.Выбрать() Тогда
				ИмяФ = ДиалогОткрытияФайла.ВыбранныеФайлы[0];
				   
				
				ДФайл = Новый ЗаписьТекста(ИмяФ,КодировкаТекста.ANSI); 
				ДФайл.ЗаписатьСтроку("РЕАЛИЗАЦИЯ");// Заголовок
				ДФайл.ЗаписатьСтроку(Строка(ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка)));              //НомерДокумента
				ДФайл.ЗаписатьСтроку(Строка(Формат(Ссылка.Дата,"ДФ=yyyyMMdd")));              //ДатаДокумента
				ДФайл.ЗаписатьСтроку(Строка(Ссылка.Организация.ИНН));              //ИННПоставщика
				//Для каждого СтрокаТЧ из Ссылка.Товары цикл
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	РеализацияТоваровУслугамбСрокиИСерии.Количество,
				|	РеализацияТоваровУслугамбСрокиИСерии.Номенклатура,
				|	РеализацияТоваровУслугамбСрокиИСерии.СерияНоменклатуры,
				|	РеализацияТоваровУслугамбСрокиИСерии.СрокГодности
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.амбСрокиИСерии КАК РеализацияТоваровУслугамбСрокиИСерии
				|ГДЕ
				|	РеализацияТоваровУслугамбСрокиИСерии.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
				Результат = Запрос.Выполнить();
				ТаблицаСоСрокамиИСериями = Результат.Выгрузить();
				//Наченем перебирать тч Товары
				СчетчикСтрок = 0;
				
				Для каждого СтрокаТЧТовары из Ссылка.Товары цикл
					
					Номенклатура		 = СтрокаТЧТовары.Номенклатура;
					НомНаименованиеПолн	 = СтрокаТЧТовары.Номенклатура.НаименованиеПолное;
					КоличествоВНакладной = СтрокаТЧТовары.Количество;
					ЕдИзмерения			 = СтрокаТЧТовары.ЕдиницаИзмерения;
					СтоимостьВНакладной  = СтрокаТЧТовары.Сумма;
					СтавкаНдс 			 = СтрокаТЧТовары.СтавкаНДС;
					ГТД					 = СтрокаТЧТовары.СерияНоменклатуры;   					
					Списываем 		= КоличествоВНакладной;
					ОсталосьСписать = Списываем;
					СписываемСТоимость = СтоимостьВНакладной;                                            
					
					//Узнаем, нужно ли разбивать эту позицию?
					НайденнаяСтрока = ТаблицаСоСрокамиИСериями.Найти(Номенклатура, "Номенклатура");
					Если НайденнаяСтрока = Неопределено Тогда
						ПодбираемСерии = Ложь;
					Иначе
						ПодбираемСерии = Истина;
					КонецЕсли;	                                             
					
					
					//Выводим в зависимости от того нужно подбирать серии или нет .
					Если ПодбираемСерии Тогда 
						//Переберем все серии
						
						Отбор = Новый Структура();
						Отбор.Вставить("Номенклатура",Номенклатура);
						Строки = ТаблицаСоСрокамиИСериями.НайтиСтроки(Отбор);				
						//Спишем по срокам из найденых строк	
						
						
						
						Для каждого СтрокаСроков из Строки цикл
							КоличествоВСерии = СтрокаСроков.Количество;
							СерияВСерии = СтрокаСроков.СерияНоменклатуры;
							СрокГодностиВСерии = СтрокаСроков.СрокГодности;
							
							Если КоличествоВСерии > ОсталосьСписать  и КоличествоВСерии>0 тогда
								
								СчетчикСтрок = СчетчикСтрок+1;	
								Списываем 					= ОсталосьСписать;
								ОсталосьСписать 			= 0;
								СписываемСТоимость 		= СтоимостьВНакладной*(Списываем/КоличествоВНакладной);
								СтрокаСроков.Количество 	= КоличествоВСерии - Списываем;
								
							ИначеЕсли КоличествоВСерии = ОсталосьСписать и КоличествоВСерии>0 тогда
								СчетчикСтрок = СчетчикСтрок+1;	
								Списываем 					= ОсталосьСписать;
								ОсталосьСписать 			= 0;
								СписываемСТоимость 		= СтоимостьВНакладной*(Списываем/КоличествоВНакладной);
								СтрокаСроков.Количество 	= КоличествоВСерии - Списываем;
								
								
							ИначеЕсли КоличествоВСерии < ОсталосьСписать и КоличествоВСерии>0 тогда
								СчетчикСтрок = СчетчикСтрок+1;	
								Списываем 					= КоличествоВСерии;
								ОсталосьСписать 			= ОсталосьСписать-Списываем;
								СписываемСТоимость 		= СтоимостьВНакладной*(Списываем/КоличествоВНакладной);
								СтрокаСроков.Количество 	= КоличествоВСерии - Списываем;
								
								
							КонецЕсли;
							Если Списываем>0 и КоличествоВСерии>0 тогда
								
								Дфайл.ЗаписатьСтроку("СТРОКАТЧТОВАРЫ");//НАчальный тег товара    
								ДФайл.ЗаписатьСтроку(Номенклатура.Артикул);//артикул номенклатуры
								Дфайл.ЗаписатьСтроку(Лев(Номенклатура.Наименование,11));//11 цифр наименования, если нет артикула
								Дфайл.ЗаписатьСтроку(Строка(Номенклатура.НаименованиеПолное));//Полное наименование номенклатуры
								Дфайл.ЗаписатьСтроку(СтавкаНДС);//Ставка НДС
								ДФайл.ЗаписатьСтроку(Строка(ЕдИзмерения));//ЕдИзм.
								Дфайл.ЗаписатьСтроку(Строка(Формат(Списываем,"ЧГ=0")));//Количество
								Дфайл.ЗаписатьСтроку(Строка(Формат(СписываемСТоимость,"ЧГ=0")));   //Сумма
								Дфайл.ЗаписатьСтроку(СокрЛП(ГТД.НомерГТД));//ГТД
								ДФайл.ЗаписатьСтроку(ГТД.СтранаПроисхождения);//Страна происхождения
								Дфайл.ЗаписатьСтроку(СерияВСерии);//Серия                                        
								Дфайл.ЗаписатьСтроку(Строка(Формат(СрокГодностиВСерии,"ДФ=yyyyMMdd")));//СрокГодности
								Дфайл.ЗаписатьСтроку("/СТРОКАТЧТОВАРЫ");//конечный тег товара
								         
							КонецЕсли;
							
						КонецЦикла;	
						
					Иначе
						//Не перебираем серии, просто выводим строку
						СчетчикСтрок = СчетчикСтрок+1;
						
						
						Дфайл.ЗаписатьСтроку("СТРОКАТЧТОВАРЫ");//НАчальный тег товара    
						ДФайл.ЗаписатьСтроку(Номенклатура.Артикул);//артикул номенклатуры
						Дфайл.ЗаписатьСтроку(Лев(Номенклатура.Наименование,11));//11 цифр наименования, если нет артикула
						Дфайл.ЗаписатьСтроку(Строка(Номенклатура.НаименованиеПолное));//Полное наименование номенклатуры
						Дфайл.ЗаписатьСтроку(СтавкаНДС);//Ставка НДС
						ДФайл.ЗаписатьСтроку(Строка(ЕдИзмерения));//ЕдИзм.
						Дфайл.ЗаписатьСтроку(Строка(Формат(Списываем,"ЧГ=0")));//Количество
						Дфайл.ЗаписатьСтроку(Строка(Формат(СписываемСТоимость,"ЧГ=0")));   //Сумма
						Дфайл.ЗаписатьСтроку(СокрЛП(ГТД.НомерГТД));//ГТД
						ДФайл.ЗаписатьСтроку(Гтд.СтранаПроисхождения);//Страна происхождения
						Дфайл.ЗаписатьСтроку("");//Серия
						Дфайл.ЗаписатьСтроку("");//СрокГодности
						Дфайл.ЗаписатьСтроку("/СТРОКАТЧТОВАРЫ");//конечный тег товара
						
					КонецЕсли;	
					
					
					
				КонецЦикла;
				
				
				Дфайл.ЗаписатьСтроку("/КОНЕЦ");//конечный тег
				ДФайл.Закрыть();

				Сообщить("Данные выгружены в файл: "+ИмяФ);
			КонецЕсли;
		////////////////////////////////////////////////////////////
		////Обработка выгрузки заказа покупателя
		////////////////////////////////////////////////////////////
		ИначеЕсли ТипЗнч(Ссылка) =  Тип("ДокументСсылка.ЗаказПокупателя") тогда
			
			Режим = РежимДиалогаВыбораФайла.Сохранение;
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогОткрытияФайла.ПолноеИмяФайла = "";
			Фильтр = "Текст(*.txt)|*.txt";
			ДиалогОткрытияФайла.Фильтр = Фильтр;
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = "Выберите имя файла";
			Если ДиалогОткрытияФайла.Выбрать() Тогда
				ИмяФ = ДиалогОткрытияФайла.ВыбранныеФайлы[0];
				   
				
				ДФайл = Новый ЗаписьТекста(ИмяФ,КодировкаТекста.ANSI); 
				ДФайл.ЗаписатьСтроку("ЗАКАЗ");// Заголовок
				ДФайл.ЗаписатьСтроку(Строка(ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка)));              //НомерДокумента
				ДФайл.ЗаписатьСтроку(Строка(Формат(Ссылка.Дата,"ДФ=yyyyMMdd")));              //ДатаДокумента
				ДФайл.ЗаписатьСтроку(Строка(Ссылка.Контрагент.ИНН));              //ИННПоставщика
				
				Для каждого СтрокаТЧ из Ссылка.Товары цикл
					
						Дфайл.ЗаписатьСтроку("СТРОКАТЧТОВАРЫ");//НАчальный тег товара  
						
						ДФайл.ЗаписатьСтроку(СтрокаТЧ.Номенклатура.Артикул);//артикул номенклатуры
						Дфайл.ЗаписатьСтроку(Лев(СтрокаТЧ.Номенклатура.Наименование,11));//11 цифр наименования, если нет артикула
						Дфайл.ЗаписатьСтроку(Строка(СтрокаТЧ.Номенклатура.НаименованиеПолное));//Полное наименование номенклатуры
						Дфайл.ЗаписатьСтроку(СтрокаТЧ.СтавкаНДС);//Ставка НДС
						ДФайл.ЗаписатьСтроку(Строка(СтрокаТЧ.ЕдиницаИзмерения));//ЕдИзм.
						Дфайл.ЗаписатьСтроку(Строка(Формат(СтрокаТЧ.количество,"ЧГ=0")));//Количество
						Дфайл.ЗаписатьСтроку(Строка(Формат(СтрокаТЧ.Сумма,"ЧГ=0")));   //Сумма

						Дфайл.ЗаписатьСтроку("/СТРОКАТЧТОВАРЫ");//конечный тег товара
	
				КонецЦикла;
				Дфайл.ЗаписатьСтроку("/КОНЕЦ");//конечный тег
                Сообщить("Данные выгружены в файл: "+ИмяФ);

			КонецЕсли;	
		КонецЕсли;	
	КонецПроцедуры
	
	
	Процедура ЗагрузитьДанныеПоДокументу (Ссылка, Форма) Экспорт
		
		Если ТипЗнч(Ссылка) =  Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
			
			Режим = РежимДиалогаВыбораФайла.Открытие;
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогОткрытияФайла.ПолноеИмяФайла = "";
			Фильтр = "Текст(*.txt)|*.txt";
			ДиалогОткрытияФайла.Фильтр = Фильтр;
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = "Выберите имя файла";
			Если ДиалогОткрытияФайла.Выбрать() Тогда
				ИмяФ = ДиалогОткрытияФайла.ВыбранныеФайлы[0];			
				ДФайл = Новый ЧтениеТекста(ИмяФ,КодировкаТекста.ANSI); 
				Идентификатор = ДФайл.ПрочитатьСтроку();
				Если Идентификатор = "РЕАЛИЗАЦИЯ" тогда
					НомерРеализации = ДФайл.ПрочитатьСтроку();
					ДатаРеализации = Дата(ДФайл.ПрочитатьСтроку());
					ИНН = СокрЛП(ДФайл.ПрочитатьСтроку());
					ТаблицаТоваров = Новый ТаблицаЗначений;
					ТаблицаТоваров.Колонки.Добавить("Артикул");
					ТаблицаТоваров.Колонки.Добавить("Имя12");
					ТаблицаТоваров.Колонки.Добавить("ПолнНаименование");
					ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
					ТаблицаТоваров.Колонки.Добавить("ЕдИзмерения");
					ТаблицаТоваров.Колонки.Добавить("Колич");
					ТаблицаТоваров.Колонки.Добавить("Сумма");
					ТаблицаТоваров.Колонки.Добавить("ГТД");
					ТаблицаТоваров.Колонки.Добавить("Страна");
					ТаблицаТоваров.Колонки.Добавить("Серия");
					ТаблицаТоваров.Колонки.Добавить("Срок");
					
					СчитаннаяСтрока="";
					Пока не СчитаннаяСтрока = "/КОНЕЦ" цикл
						СчитаннаяСтрока = ДФайл.ПрочитатьСтроку();
						Если СчитаннаяСтрока = "СТРОКАТЧТОВАРЫ" тогда
							СтрокаТЗТоваров = ТаблицаТоваров.Добавить();
							СтрокаТЗТОваров.Артикул    =       ДФайл.ПрочитатьСтроку();      
							СтрокаТЗТОваров.Имя12      =       ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.ПолнНаименование = ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.СтавкаНДС   =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.ЕдИзмерения =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.Колич       =      Число(ДФайл.ПрочитатьСтроку());
							СтрокаТЗТОваров.Сумма       =      Число(ДФайл.ПрочитатьСтроку());
							СтрокаТЗТОваров.ГТД         =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.Страна      =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.Серия       =      ДФайл.ПрочитатьСтроку();
							СрокГодности                =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.Срок        =      ?(ЗначениеЗаполнено(СрокГодности),Дата(СрокГодности),'00010101');
						КонецЕсли;	
					КонецЦикла;	
					
				КонецЕсли;				
				ДФайл.Закрыть();
				//Обработаем считанные данные 
				//Проверим, заполнено ли поле контрагент?
				Если не ЗначениеЗаполнено(Форма.Контрагент) тогда
					//Пробуем найти по ИНН     					
					Контрагенты = Справочники.Контрагенты;
					НайденнаяСсылка = Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
					Если не НайденнаяСсылка = Контрагенты.ПустаяСсылка() Тогда
						Форма.Контрагент = НайденнаяСсылка.Ссылка; 		   
					КонецЕсли;
				КонецЕсли;	
					//Добавим в комсментарий, что  данные были загружены из файла обмена с вектором
					Форма.Комментарий = Форма.Комментарий + " НАКЛАДНАЯ: №"+ НомерРеализации +" от "+Формат(ДатаРеализации,"ДФ=dd.MM.yyyy");
					ФормаРеализации = ЭтотОбъект.ПолучитьФорму(,Форма);
					Для каждого СтрокаЗагружаемая из ТаблицаТоваров цикл
						
						СтрокаТОваров 							= ФормаРеализации.Товары.добавить();
						СтрокаТоваров.Артикул 					= СтрокаЗагружаемая.Артикул;
						СтрокаТоваров.Имя12 					= СтрокаЗагружаемая.Имя12;
						СтрокаТоваров.Наименование 				= СтрокаЗагружаемая.ПолнНаименование; 					
						СтрокаТоваров.НайденнаяНоменклатура 	= ПодобратьНоменклатуру(СтрокаЗагружаемая.Артикул, СтрокаЗагружаемая.Имя12);
						СтрокаТоваров.СтавкаНДСЗагруженная 		= СтрокаЗагружаемая.СтавкаНДС;
						СтрокаТоваров.СтавкаНДСТекущая 			= Строка(СтрокаТоваров.НайденнаяНоменклатура.СтавкаНДС);
						СтрокаТоваров.ЕдИзмеренияЗагруженная 	= СтрокаТЗТОваров.ЕдИзмерения;
						СтрокаТоваров.ЕдИзмеренияТекущая 		= Строка(СтрокаТоваров.НайденнаяНоменклатура.БазоваяЕдиницаИзмерения);
						СтрокаТоваров.Количество                = СтрокаЗагружаемая.Колич;
						СтрокаТоваров.Сумма 					= СтрокаЗагружаемая.Сумма;
						СтрокаТоваров.ГТДЗагруженный			= СтрокаЗагружаемая.ГТД;
						СтрокаТоваров.ГТДНайденный				= НайтиСериюНоменклатуры(СтрокаЗагружаемая.ГТД, СтрокаТоваров.НайденнаяНоменклатура);
						СтрокаТоваров.Страна					= НайтиСтрану(СтрокаЗагружаемая.Страна);
						СтрокаТоваров.СрокГодности				= СтрокаЗагружаемая.Срок;
						СтрокаТоваров.Серия 					= СтрокаЗагружаемая.Серия;
						//Пробуем найти загружаемый товар в документе, возможно он уже был загружен...
							ТаблицаУжеЗагруженныхТоваров = Форма.Товары.Выгрузить();
							Отбор = Новый Структура();
							Отбор.Вставить("Номенклатура",СтрокаТоваров.НайденнаяНоменклатура);
							Отбор.Вставить("СерияНоменклатуры",СтрокаТоваров.ГТДНайденный);
							Отбор.Вставить("Количество",СтрокаТоваров.Количество);
							Отбор.Вставить("СрокГодности",СтрокаТоваров.СрокГодности);

							Строки = ТаблицаУжеЗагруженныхТоваров.НайтиСтроки(Отбор);
							Если Строки.Количество() > 0 Тогда
							СтрокаТоваров.НеЗагружать	 = Истина;
							КонецЕсли;

					КонецЦикла;
					ФормаРеализации.Открыть();
			
				
                 					
				КонецЕсли;
				
		////////////////////////////////////////////////
		///ЗагрузкаДанных в заказ покупателя.
		////////////////////////////////////////////////
		 ИначеЕсли ТипЗнч(Ссылка) =  Тип("ДокументСсылка.ЗаказПокупателя") тогда
			 
			Режим = РежимДиалогаВыбораФайла.Открытие;
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогОткрытияФайла.ПолноеИмяФайла = "";
			Фильтр = "Текст(*.txt)|*.txt";
			ДиалогОткрытияФайла.Фильтр = Фильтр;
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = "Выберите имя файла";
			Если ДиалогОткрытияФайла.Выбрать() Тогда
				ИмяФ = ДиалогОткрытияФайла.ВыбранныеФайлы[0];			
				ДФайл = Новый ЧтениеТекста(ИмяФ,КодировкаТекста.ANSI); 
				Идентификатор = ДФайл.ПрочитатьСтроку();
				Если Идентификатор = "ЗАКАЗ" тогда
					НомерЗаказа = ДФайл.ПрочитатьСтроку();
					ДатаЗаказа = Дата(ДФайл.ПрочитатьСтроку());
					ИНН = СокрЛП(ДФайл.ПрочитатьСтроку());
					ТаблицаТоваров = Новый ТаблицаЗначений;
					ТаблицаТоваров.Колонки.Добавить("Артикул");
					ТаблицаТоваров.Колонки.Добавить("Имя12");
					ТаблицаТоваров.Колонки.Добавить("ПолнНаименование");
					ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
					ТаблицаТоваров.Колонки.Добавить("ЕдИзмерения");
					ТаблицаТоваров.Колонки.Добавить("Колич");
					ТаблицаТоваров.Колонки.Добавить("Сумма");
					
					СчитаннаяСтрока="";
					Пока не СчитаннаяСтрока = "/КОНЕЦ" цикл
						СчитаннаяСтрока = ДФайл.ПрочитатьСтроку();
						Если СчитаннаяСтрока = "СТРОКАТЧТОВАРЫ" тогда
							СтрокаТЗТоваров = ТаблицаТоваров.Добавить();
							СтрокаТЗТОваров.Артикул    =       ДФайл.ПрочитатьСтроку();      
							СтрокаТЗТОваров.Имя12      =       ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.ПолнНаименование = ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.СтавкаНДС   =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.ЕдИзмерения =      ДФайл.ПрочитатьСтроку();
							СтрокаТЗТОваров.Колич       =      Число(ДФайл.ПрочитатьСтроку());
							СтрокаТЗТОваров.Сумма       =      Число(ДФайл.ПрочитатьСтроку());
						КонецЕсли;	
					КонецЦикла;	
					
				КонецЕсли;				
				ДФайл.Закрыть();
				//Обработаем считанные данные 
				//Проверим, заполнено ли поле контрагент?
				Если не ЗначениеЗаполнено(Форма.Контрагент) тогда
					//Пробуем найти по ИНН     					
					Контрагенты = Справочники.Контрагенты;
					НайденнаяСсылка = Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
					Если не НайденнаяСсылка = Контрагенты.ПустаяСсылка() Тогда
						Форма.Контрагент = НайденнаяСсылка.Ссылка; 		   
					КонецЕсли;
				КонецЕсли;	
					//Добавим в комсментарий, что  данные были загружены из файла обмена с вектором
					Форма.Комментарий = Форма.Комментарий + " ПРЕГРУЖЕНО ИЗ ЗАКАЗА: №"+ НомерЗаказа +" от "+Формат(ДатаЗаказа, "ДФ=dd.MM.yyyy");
					ФормаЗаказа = ЭтотОбъект.ПолучитьФорму("ФормаЗаказ",Форма);
					Для каждого СтрокаЗагружаемая из ТаблицаТоваров цикл
						
						СтрокаТОваров 							= ФормаЗаказа.Товары.добавить();
						СтрокаТоваров.Артикул 					= СтрокаЗагружаемая.Артикул;
						СтрокаТоваров.Имя12 					= СтрокаЗагружаемая.Имя12;
						СтрокаТоваров.Наименование 				= СтрокаЗагружаемая.ПолнНаименование; 					
						СтрокаТоваров.НайденнаяНоменклатура 	= ПодобратьНоменклатуру(СтрокаЗагружаемая.Артикул, СтрокаЗагружаемая.Имя12);
						СтрокаТоваров.СтавкаНДСЗагруженная 		= СтрокаЗагружаемая.СтавкаНДС;
						СтрокаТоваров.СтавкаНДСТекущая 			= Строка(СтрокаТоваров.НайденнаяНоменклатура.СтавкаНДС);
						СтрокаТоваров.ЕдИзмеренияЗагруженная 	= СтрокаТЗТОваров.ЕдИзмерения;
						СтрокаТоваров.ЕдИзмеренияТекущая 		= Строка(СтрокаТоваров.НайденнаяНоменклатура.БазоваяЕдиницаИзмерения);
						СтрокаТоваров.Количество                = СтрокаЗагружаемая.Колич;
						СтрокаТоваров.Сумма 					= СтрокаЗагружаемая.Сумма;
					КонецЦикла;
					ФормаЗаказа.Открыть();
			
				
                 					
				КонецЕсли;

		
		КонецЕсли;
	КОнецПроцедуры	

	
Функция ПреобразоватьСтавкуНДС (СтавкаНДС) Экспорт
	
	Если СтавкаНДС = "18%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли СтавкаНДС = "18% / 118%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли СтавкаНДС = "20%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС20;		 		 
	ИначеЕсли СтавкаНДС = "20% / 120%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС20_120;
	ИначеЕсли СтавкаНДС = "10%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС10;		 
	ИначеЕсли СтавкаНДС = "10% / 110%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли СтавкаНДС = "0%" тогда
		 Возврат Перечисления.СтавкиНДС.НДС0;		 
	КонецЕсли;	
	                                        
КонецФункции	

Функция НайтиСтрану (СтрокаПоиска)Экспорт
	
Страны = Справочники.КлассификаторСтранМира;
НайденнаяСсылка = Страны.НайтиПоНаименованию(СтрокаПоиска);
Возврат НайденнаяСсылка;	
	
КонецФункции	

Функция ПодобратьНоменклатуру(Артикул, Имя12)
	  //Пробуем найти по артикулу
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	Номенклатура.Ссылка
	  |ИЗ
	  |	Справочник.Номенклатура КАК Номенклатура
	  |ГДЕ
	  |	Номенклатура.ПометкаУдаления = ЛОЖЬ
	  |	И Номенклатура.Артикул ПОДОБНО &Артикул";
	  
	  Запрос.УстановитьПараметр("Артикул", СокрЛП(Артикул)+"%" );
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Если Выборка.Следующий() и ЗначениеЗаполнено(Артикул) Тогда
	  
	  	  Возврат Выборка.Ссылка;
		  
	  Иначе	  
		  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	Номенклатура.Ссылка
	                 |ИЗ
	                 |	Справочник.Номенклатура КАК Номенклатура
	                 |ГДЕ
	                 |	Номенклатура.ПометкаУдаления = ЛОЖЬ
	                 |	И Номенклатура.Наименование ПОДОБНО &Наименование";
	  
	  Запрос.УстановитьПараметр("Наименование", СокрЛП(Имя12)+"%" );
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Если Выборка.Следующий() и ЗначениеЗаполнено(Имя12) Тогда
	  
	  	  Возврат Выборка.Ссылка;
		  
	  Иначе	  
		  Возврат Справочники.Номенклатура.ПустаяСсылка();
	  КонецЕсли;

	  КонецЕсли;
	  
	  
  КонецФункции	
  
Функция НайтиСериюНоменклатуры (ГТД, НоменклатураВладелец) экспорт
	Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	СерииНоменклатуры.Ссылка
	                 |ИЗ
	                 |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	                 |ГДЕ
	                 |	СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	                 |	И СерииНоменклатуры.Наименование ПОДОБНО &Наименование
	                 |	И СерииНоменклатуры.Владелец = &Владелец";
	  
	  Запрос.УстановитьПараметр("Наименование", СокрЛП(ГТД)+"%" );
	  Запрос.УстановитьПараметр("Владелец", НоменклатураВладелец);
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Если Выборка.Следующий() и ЗначениеЗаполнено(ГТД) Тогда
	  
	  	  Возврат Выборка.Ссылка;
		  
	  Иначе	  
		  Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	  КонецЕсли;
  
  КонецФункции
